Revit 2027 API
RebarBendingDetail.IsBendingDetail Method
 Checks if the input element is a bending detail.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsBendingDetail(
	Element bendingDetail
)
Public Shared Function IsBendingDetail (
	bendingDetail As Element
) As Boolean
public:
static bool IsBendingDetail(
	Element^ bendingDetail
)
static member IsBendingDetail :
        bendingDetail : Element -> bool
Parameters
bendingDetail Element
 The element that will be checked.
Return Value
Boolean
 Returns true if the input element is a bending detail, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The bendingDetail should be a bending detail.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace